Tekla Open API Reference for Tekla Structures 2025
Operation.CopyObject Method
Overload List
Name | Description
CopyObject(ModelObject, Vector)
 Copies the model object using the given translation vector.
CopyObject(ModelObject, CoordinateSystem, CoordinateSystem)
 Copies the model object between the given translation coordinate systems.
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace